{
  "architectures": [
    "MiniMindVLM"
  ],
  "auto_map": {
    "AutoConfig": "model_vlm.VLMConfig",
    "AutoModelForCausalLM": "model_vlm.MiniMindVLM"
  },
  "aux_loss_alpha": 0.1,
  "bos_token_id": 1,
  "dropout": 0.0,
  "eos_token_id": 2,
  "flash_attn": true,
  "hidden_act": "silu",
  "hidden_size": 768,
  "image_ids": [
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34,
    34
  ],
  "image_special_token": "@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
  "intermediate_size": 2048,
  "max_position_embeddings": 32768,
  "max_seq_len": 8192,
  "model_type": "minimind-v",
  "n_routed_experts": 4,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 8,
  "num_experts_per_tok": 1,
  "num_hidden_layers": 16,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-05,
  "rope_theta": 1000000.0,
  "scoring_func": "softmax",
  "seq_aux": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "use_moe": false,
  "vocab_size": 6400
}
